Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `io.vertx.core.json.JsonObject` will be configured with `io.quarkus.pulsar.schema.JsonObjectSchema` schema
ja_jp: `io.vertx.core.json.JsonObject` は、 `io.quarkus.pulsar.schema.JsonObjectSchema` スキーマで設定されます。

source: `io.vertx.mutiny.core.Vertx` instance exposing the _Mutiny_ API
ja_jp: _Mutiny_ APIを公開する `io.vertx.mutiny.core.Vertx` インスタンス

source: `io.vertx` package => `io.vertx.mutiny` package
ja_jp: `io.vertx` パッケージ ⇒ `io.vertx.mutiny` パッケージ

source: `io_uring` is a Linux kernel interface that allows you to send and receive data asynchronously. It provides unified semantics for both file and network I/O. It was originally designed to target block devices and files but has since gained the ability to work with things like network sockets. It has the potential to provide modest performance benefits to network I/O on its own and greater benefits for mixed file and network I/O application workloads.
ja_jp: `io_uring` は、データを非同期に送受信できる Linux カーネルインターフェイスです。 ファイルとネットワーク I/O の両方に、統一されたセマンティクスを提供します。 もともとはブロックデバイスとファイルを対象に設計されていましたが、その後、ネットワークソケットなどでも動作するようになりました。 単独で、ある程度のパフォーマンス上の利点をネットワーク I/O にもたらす可能性があります。ファイルとネットワーク I/O が混在するアプリケーションのワークロードには、さらに大きな利点をもたらす可能性があります。

source: `io_uring` is not supported in native executables.
ja_jp: `io_uring` はネイティブ実行可能ファイルではサポートされていません。

source: `io_uring` support is experimental
ja_jp: `io_uring` サポートは実験的です。

source: `io_uring` support is still experimental. Check the https://github.com/netty/netty-incubator-transport-io_uring#faq[Netty io_uring FAQ] if you see some odd behavior. Also, the https://github.com/netty/netty-incubator-transport-io_uring/issues/152[netty io_uring was slower than epoll] issue describes a few configuration mistakes.
ja_jp: `io_uring` のサポートはまだ実験段階です。 異常な動作が見られる場合は、 https://github.com/netty/netty-incubator-transport-io_uring#faq[Netty io_uring FAQ] を確認してください。 また、 https://github.com/netty/netty-incubator-transport-io_uring/issues/152[netty io_uring was slower than epoll] issue で、いくつかの設定ミスについて説明されています。

source: `isEmpty`: Returns true if a map contains no key-value mappings
ja_jp: `isEmpty` : マップにキーと値のマッピングが含まれていない場合に true を返します。

source: `isHttps` is `false` because `https` is not used.
ja_jp: `https` が使用されていないため、 `isHttps` は `false` です。

source: `isSecure` is false as https is not used
ja_jp: `isSecure` は https が使用されていないため false です

source: `it_count` represents one-based index.
ja_jp: `it_count` は 1 を基準としたインデックスを表します。

source: `it` is a special key that is replaced with the first unnamed parameter of the tag.
ja_jp: `it` は、タグの最初の名前のないパラメーターに置き換えられる特別なキーです。

source: `it` is replaced with the first unnamed parameter of the tag.
ja_jp: `it` はタグの最初の名前なしパラメーターに置き換えられます。

source: `item.calculateDiscount(10)` is evaluated first and then passed as an argument to `item.subtractPrice()`.
ja_jp: `item.calculateDiscount(10)` が最初に評価され、その後 `item.subtractPrice()` への引数として渡されます。

source: `item.discountedPrice` is resolved to an instance of `BigDecimal`.
ja_jp: `item.discountedPrice` は `BigDecimal` のインスタンスに解決されます。

source: `item.price or 5` is translated to `item.price.or(5)`.
ja_jp: `item.price or 5` は `item.price.or(5)` に翻訳されます。

source: `item_count` represents one-based index.
ja_jp: `item_count` は 1 を基準としたインデックスを表します。

source: `item` is an alias for the iterated element.
ja_jp: `item` は反復要素のエイリアスです。

source: `item` is passed to the template instance as a data object.
ja_jp: `item` はデータオブジェクトとしてテンプレートインスタンスに渡されます。

source: `item` is resolved to an instance of `org.acme.Item`.
ja_jp: `item` は `org.acme.Item` のインスタンスに解決されます。

source: `item` is resolved to an iteration element and can be referenced using the `it` key in the tag template.
ja_jp: `item` は反復要素に解決され、タグテンプレートで `it` キーを使用して参照することができます。

source: `item` is the alias used for the iteration element.
ja_jp: `item` は、反復処理要素に使用されるエイリアスです。

source: `items` is resolved to a list of `org.acme.Item` instances.
ja_jp: `items` は `org.acme.Item` インスタンスのリストに解決されます。

source: `jakarta.enterprise.event.Event` is used to fire events.
ja_jp: `jakarta.enterprise.event.Event` は、イベントの発行に使われています。

source: `jakarta.enterprise.inject.Instance` extends `Iterable`.
ja_jp: `jakarta.enterprise.inject.Instance` は、 `Iterable` を拡張します。

source: `java.net.InetSocketAddress`, `java.net.InetAddress` and `org.wildfly.common.net.CidrAddress`
ja_jp: `java.net.InetSocketAddress`、 `java.net.InetAddress`、および `org.wildfly.common.net.CidrAddress`

source: `java.nio.charset.Charset` where the string value is a canonical name or an alias
ja_jp: 文字列値が正規名またはエイリアス の `java.nio.charset.Charset`

source: `java.time.ZoneId` where the string value is parsed via `java.time.ZoneId.of(String)`
ja_jp: 文字列値が `java.time.ZoneId.of(String)` を介して解析される `java.time.ZoneId`

source: `java.util.List` and `Set` are also supported as property values. For example:
ja_jp: `java.util.List` と `Set` もプロパティー値としてサポートされています。例えば

source: `java.util.Locale` where the string value is an IETF BCP 47 language tag
ja_jp: 文字列値が IETFBCP47 言語タグの `java.util.Locale`

source: `java.util.logging.manager` (see xref:logging.adoc[Logging Guide])
ja_jp: `java.util.logging.manager` (xref:logging.adoc[ロギングガイド] を参照)

source: `javax.enterprise.event.Event` is used to fire events.
ja_jp: `javax.enterprise.event.Event` は、イベントの火付けに使われています。

source: `javax.enterprise.inject.Instance` extends `Iterable`.
ja_jp: `javax.enterprise.inject.Instance` は `Iterable` を継承します。

source: `jokes` added as a build time data key on the Page Build Item.
ja_jp: Page Build Item のビルド時データキーとして `jokes` が追加されました。

source: `jti` (unique token identifier)
ja_jp: `jti` (一意のトークン識別子)

source: `jvm.threads.states` (xref:telemetry-micrometer#gauges[Gauge] per state)
ja_jp: `jvm.threads.states` (ステートごとの xref:telemetry-micrometer#gauges[Gauge])

source: `keepAliveTime` becomes `keep-alive-time`
ja_jp: `keepAliveTime` は `keep-alive-time` になります

source: `keepttl()` - Retain the time to live associated with the key.
ja_jp: `keepttl()`: キーに関連付けられた有効期限を保持します。

source: `keys` or `keySet`: Returns a Set view of the keys contained in a map
ja_jp: `keys` または `keySet` : マップに含まれるキーのセットビューを返します。

source: `kind` - include beans of the specified kind (`CLASS`, `PRODUCER_FIELD`, `PRODUCER_METHOD`, `INTERCEPTOR` or `SYNTHETIC`), i.e. `http://localhost:8080/q/arc/beans?kind=PRODUCER_METHOD`
ja_jp: `kind` - 指定された種類の Bean (`CLASS`、 `PRODUCER_FIELD`、 `PRODUCER_METHOD`、 `INTERCEPTOR`、または `SYNTHETIC`) を含みます (つまり `http://localhost:8080/q/arc/beans?kind=PRODUCER_METHOD`)。

source: `last`: Returns the last element of the given list; throws an `NoSuchElementException` if the list is empty
ja_jp: `last`: 指定されたリストの最後の要素を返します。リストが空の場合、`NoSuchElementException` をスローします。

source: `lastname is not null` will be mapped to `{'lastname':{'$exists': true}}`
ja_jp: `lastname is not null` は `{'lastname':{'$exists': true}}` にマッピングされます。

source: `lastname like ?1` will be mapped to `{'lastname': {'$regex': ?1}}`. Be careful that this will be link:https://docs.mongodb.com/manual/reference/operator/query/regex/#op._S_regex[MongoDB regex] support and not SQL like pattern.
ja_jp: `lastname like ?1` は `{'lastname': {'$regex': ?1}}` にマッピングされます。これは link:https://docs.mongodb.com/manual/reference/operator/query/regex/#op._S_regex[MongoDB の正規表現]をサポートするもので、SQL のようなパターンではないことに注意しましょう。

source: `latest` commits the record offset received by the Kafka consumer as soon as the associated message is acknowledged (if the offset is higher than the previously committed offset). This strategy provides at-least-once delivery if the channel processes the message without performing any asynchronous processing. This strategy should not be used in high load environment, as offset commit is expensive. However, it reduces the risk of duplicates.
ja_jp: `latest` は、関連するメッセージが確認応答されるとすぐに、Kafka コンシューマーが受信したレコードオフセットをコミットします (オフセットが以前にコミットされたオフセットよりも大きい場合)。このストラテジーは、チャネルが非同期処理を実行せずにメッセージを処理する場合、少なくとも 1 回の配信を提供します。オフセットコミットはコストがかかるため、このストラテジーは高負荷環境では使用しないでください。ただし、これにより、重複のリスクは軽減されます。

source: `latest` commits the record offset received by the Kafka consumer as soon as the associated message is acknowledged (if the offset is higher than the previously committed offset). This strategy provides at-least-once delivery if the channel processes the message without performing any asynchronous processing. Specifically, the offset of the most recent acknowledged message will always be committed, even if older messages have not finished being processed. In case of an incident such as a crash, processing would restart after the last commit, leading to older messages never being successfully and fully processed, which would appear as message loss. This strategy should not be used in high load environment, as offset commit is expensive. However, it reduces the risk of duplicates.
ja_jp: `latest` は、関連するメッセージが確認応答されるとすぐに、Kafka コンシューマーが受信したレコードオフセットをコミットします (そのオフセットが以前にコミットされたオフセットよりも高い場合)。 このストラテジーは、チャネルがメッセージを非同期処理なしで処理する場合、少なくと1 回の配信 (at-least-once delivery) を提供します。具体的には、最も最近確認応答されたメッセージのオフセットは、 処理が終了していない古いメッセージがあっても、常にコミットされます。クラッシュなどのインシデントが発生した場合、処理は最後のコミット後に再開されるため、 古いメッセージが正常かつ完全に処理されず、メッセージが失われたように見えることがあります。 このストラテジーは、オフセットコミットが高コストであるため、高負荷環境では使用しないでください。ただし、重複のリスクは軽減されます。

source: `ldd` shows the shared library dependencies of an executable:
ja_jp: `ldd` は、実行可能ファイルの共有ライブラリの依存関係を表示します。

source: `legacy-jar` builds work similar to `fast-jar` builds, except that the directory structure is different and the `modified-*.jar` files are considered as generated.
ja_jp: `legacy-jar` のビルドは、ディレクトリ構造が異なることと、 `modified-*.jar` のファイルが生成されたとみなされることを除き、 `fast-jar` のビルドと同様に動作します。

source: `libsunec.so` must be added to `function.zip`
ja_jp: `function.zip` に `libsunec.so` を追加する必要があります。

source: `load-script` is a build time property than cannot be overridden at runtime.
ja_jp: `load-script` はビルド時のプロパティであり、実行時にオーバーライドすることはできません。

source: `locale` Attribute Example
ja_jp: `locale` 属性の例

source: `log` - a name segment which corresponds to the `LogConfiguration` class annotated with `@ConfigRoot`,
ja_jp: `log` - `@ConfigRoot` でアノテーションが付けられた `LogConfiguration` クラスに対応する名前セグメント。

source: `log` - a name segment which corresponds to the prefix set in the interface annotated with `@ConfigMapping`,
ja_jp: `enabled` - `@ConfigGroup` アノテーションが付けられた `FileConfig` クラスの `enable` フィールドに対応する名前セグメント。

source: `long` and `java.lang.Long`
ja_jp: `long` および `java.lang.Long`

source: `manage.sh` - wrapper around aws lambda cli calls
ja_jp: `manage.sh` - aws Lambda CLI の呼び出しのラッパー

source: `manage.sh` supports four operation: `create`, `delete`, `update`, and `invoke`.
ja_jp: `manage.sh` は、 `create` , `delete` , `update` , `invoke` の 4 つの操作をサポートしています。

source: `maven-surefire-plugin` and `maven-failsafe-plugin` configurations showed above will work in most cases. However, there could be cases when extra configuration will be required.
ja_jp: `maven-surefire-plugin` および `maven-failsafe-plugin` の設定は、ほとんどのケースで機能します。しかし、追加の設定が必要になる場合もあります。

source: `maven.home` (only if there are any custom settings in `${maven.home}/conf/settings.xml`, see xref:maven-tooling.adoc[Maven Guide])
ja_jp: `maven.home` (`${maven.home}/conf/settings.xml` にカスタム設定がある場合のみ)、xref:maven-tooling.adoc[Maven Guide] を参照)

source: `maven.multiModuleProjectDirectory` is meant to be consulted by the Maven code itself and not something to be relied upon by user code. So, if you find it useful, use it at your own risk!
ja_jp: `maven.multiModuleProjectDirectory` は、Maven コード自体が参照することを意図しており、ユーザーコードが頼るべきものではありません。なので、もし便利だと思っても、自分の責任で使ってくださいね。

source: `maven.settings` (in case a custom version of `settings.xml` file should be used for the tests)
ja_jp: `maven.settings` (カスタム版の `settings.xml` ファイルをテストに使用する場合)

source: `max`: The longest duration, probably it was with a large prime number.
ja_jp: `max` : 最長所要時間、おそらく大きな素数に対して行われたものです。

source: `meanRate, oneMinRate, fiveMinRate, fifteenMinRate`: Mean throughput and one-, five-, and fifteen-minute exponentially-weighted moving average throughput.
ja_jp: `meanRate, oneMinRate, fiveMinRate, fifteenMinRate` : 平均スループットと 1、5、および 15 分間の指数関数的に加重された移動平均スループット。

source: `mean`: The mean value of the measured durations.
ja_jp: `mean` : 計測された所要時間の平均値。

source: `metadata.config`: Filters configuration keys shown when clicking "Configuration" on the card.
ja_jp: `metadata.config`: カードの「設定」をクリックしたときに表示される設定キーをフィルタリングします。

source: `microprofile-config.properties` from application
ja_jp: アプリケーションからの `microprofile-config.properties`

source: `min`: The shortest duration it took to perform a primality test was probably performed for a small number.
ja_jp: `min`: 素数テストを実行するのにかかった最短時間。おそらく小さな数に対して実行されたものです。

source: `minus` or `-`: Subtraction
ja_jp: `minus` または `-`: 引き算

source: `mod`: Modulo operation
ja_jp: `mod` : モデューロ演算

source: `mode` - the default value is `prod`, i.e. the production build dependency tree. Alternatively, it accepts values `test` to display the test dependency tree and `dev` to display the dev mode dependency tree;
ja_jp: `mode` - デフォルト値は `prod` で、本番ビルドの依存関係ツリーを表示します。または、値 `test` を受け入れてテスト依存関係ツリーを表示し、 `dev` を受け入れて開発モードの依存関係ツリーを表示します。

source: `modified-failed-undeliverable-here` - this strategy marks the AMQP message as _modified_ and indicates that it failed (with the `delivery-failed` attribute). It also indicates that the application cannot process the message, meaning that the broker will not attempt to redeliver the message to this node. The processing continues with the next message. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation]
ja_jp: `modified-failed-undeliverable-here` - この戦略は、AMQP メッセージを _modified_ としてマークし、失敗したことを示します ( `delivery-failed` 属性を使用)。また、アプリケーションがメッセージを処理できないことも示しています。つまり、ブローカーはメッセージをこのノードに再配信しようとはしません。処理は次のメッセージに進みます。 http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation] を参照してください

source: `modified-failed-undeliverable-here` - this strategy marks the AMQP message as _modified_ and indicates that it failed (with the `delivery-failed` attribute). It also indicates that the application cannot process the message, meaning that the broker will not attempt to redeliver the message to this node. The processing continues with the next message. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation]
ja_jp: `modified-failed-undeliverable-here` - この戦略は、AMQP メッセージを _modified_ としてマークし、失敗したことを示します ( `delivery-failed` 属性を使用)。また、アプリケーションがメッセージを処理できないことも示しています。つまり、ブローカーはメッセージをこのノードに再配信しようとはしません。処理は次のメッセージに進みます。 https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation] を参照してください

source: `modified-failed` - this strategy marks the AMQP message as _modified_ and indicates that it failed (with the `delivery-failed` attribute). The processing continues with the next message, but the broker may attempt to redeliver the message. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation]
ja_jp: `modified-failed` - この戦略は、AMQP メッセージを _modified_ としてマークし、失敗したことを示します (`delivery-failed` 属性を使用)。処理は次のメッセージから続行されますが、ブローカーはメッセージの再配信を試みる可能性があります。 http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation] を参照してください

source: `modified-failed` - this strategy marks the AMQP message as _modified_ and indicates that it failed (with the `delivery-failed` attribute). The processing continues with the next message, but the broker may attempt to redeliver the message. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation]
ja_jp: `modified-failed` - この戦略は、AMQP メッセージを _modified_ としてマークし、失敗したことを示します (`delivery-failed` 属性を使用)。処理は次のメッセージから続行されますが、ブローカーはメッセージの再配信を試みる可能性があります。 https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation] を参照してください

source: `mongo+srv://` support in native executables
ja_jp: `mongo+srv://` のネイティブ実行可能ファイルでのサポート

source: `mongo+srv://` urls are supported out of the box in JVM mode. However, in native, the default DNS resolver, provided by the MongoDB client, uses JNDI and does not work in native mode.
ja_jp: `mongo+srv://` url は、JVM モードではサポートされます。しかし、ネイティブモードでは、MongoDB クライアントが提供するデフォルトの DNS リゾルバは JNDI を使っているので動作しません。

source: `mp.messaging.connector.smallrye-kafka.apicurio.registry.url` is configured
ja_jp: `mp.messaging.connector.smallrye-kafka.apicurio.registry.url` が設定されていること

source: `mp.messaging.connector.smallrye-kafka.schema.registry.url` is configured
ja_jp: `mp.messaging.connector.smallrye-kafka.schema.registry.url` が設定されていること

source: `mp.messaging.incoming.requests.auto.offset.reset=earliest` instructs the application to start reading the topics from the first offset, when there is no committed offset for the consumer group. In other words, it will also process messages sent before we start the processor application.
ja_jp: `mp.messaging.incoming.requests.auto.offset.reset=earliest` は、コンシューマーグループにコミットされたオフセットがない場合に、最初のオフセットからトピックの読み取りを開始するようにアプリケーションに指示します。つまり、プロセッサーアプリケーションを起動する前に送信されたメッセージも処理します。

source: `mp.messaging.incoming.requests.subscriptionInitialPosition=Earliest` instructs the application to start reading the topics from the first message on the topic, when there is no previously acked messages. In other words, it will also process messages sent before we start the processor application.
ja_jp: `mp.messaging.incoming.requests.subscriptionInitialPosition=Earliest` は、以前に確認応答されたメッセージがない場合に、トピックの最初のメッセージからトピックの読み取りを開始するようにアプリケーションに指示します。 つまり、プロセッサーアプリケーションを起動する前に送信されたメッセージも処理します。

source: `msg` is the default namespace.
ja_jp: `msg` がデフォルトの名前空間です。

source: `mvn quarkus:dev` automatically picks up the properties in the `.env` file, similar to those in the `application.properties` file.
ja_jp: `mvn quarkus:dev` は、 `application.properties` ファイルのプロパティと同様に、 `.env` ファイルのプロパティを自動的にピックアップします。

source: `my.prop` value is 5678.
ja_jp: `my.prop` の値は5678です。

source: `my.prop` value is `5678`
ja_jp: `my.prop` 値は `5678`

source: `n` or `false` - The debug mode JVM is started without suspending
ja_jp: `n` または `false` - デバッグモードの JVM をサスペンドせずに起動します。

source: `nack` *(default)* sends https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#negative-acknowledgment[negative acknowledgment] to the broker, triggering the broker to redeliver this message to the consumer. The negative acknowledgment can be further configured using `negativeAckRedeliveryDelayMicros` and `negativeAck.redeliveryBackoff` properties.
ja_jp: `nack` *(デフォルト)* は、ブローカーに https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#negative-acknowledgment[否定応答] を送信し、ブローカーがこのメッセージをコンシューマーに再配信するようにトリガーします。 否定応答は、 `negativeAckRedeliveryDelayMicros` プロパティーと `negativeAck.redeliveryBackoff` プロパティーを使用してさらに設定できます。

source: `name` is resolved against the current iteration element.
ja_jp: `name` は現在の反復要素に対して解決されます。

source: `name`: Displayed as the extension title in the Dev UI card.
ja_jp: `name`: Dev UI カードにエクステンションのタイトルとして表示されます。

source: `namedQuery` - a named query that should be configured at entity level using the annotation `@NamedQuery`.
ja_jp: `namedQuery` - `@NamedQuery`アノテーションを用いてエンティティレベルで設定されるべき名前付きクエリです。

source: `never`: never use replica nodes, always send queries to master nodes (this is the default)
ja_jp: `never`: レプリカノードは使用せず、常にマスターノードにクエリーを送信します (これがデフォルトです)

source: `never`: never use replica nodes, always send queries to the master node (this is the default)
ja_jp: `never`: レプリカノードは使用せず、常にマスターノードにクエリーを送信します (これがデフォルトです)

source: `none` - don't scan dependencies, use only what is defined in `src/main/proto` or `src/test/proto`
ja_jp: `none` - 依存関係をスキャンせず、 `src/main/proto` または `src/test/proto` で定義されているもののみを使用します。

source: `none` - don't scan the dependencies, use only what is defined in the `src/main/proto` or `src/test/proto`
ja_jp: `none` - 依存関係をスキャンしないで、 `src/main/proto` または `src/test/proto` のみで定義されたものを利用する

source: `none` -- Hibernate Validator integration will be disabled.
ja_jp: `none` -- Hibernate Validator の統合が無効になります。

source: `null` is a valid value though. It is considered `falsy` as described in <<if_section>> and does not produce any output.
ja_jp: しかし、`null` は有効な値です。<<if_section>> にあるように `falsy` とみなされ、何も出力されません。

source: `null` is a valid value though. It is considered `falsy` as described in the <<if_section>> and does not produce any output.
ja_jp: しかし、 `null` は有効な値です。<<if_section>> にあるように `falsy` とみなされ、何も出力されません。

source: `null` is a valid value though. It is considered `falsy` as described in xref:if_section[If Section] and does not produce any output.
ja_jp: `null` は有効な値ですが、 xref:if_section[If セクション] に記載されているように `falsy` とみなされ、出力はされません。

source: `nx()` - Only set the key if it does not already exist.
ja_jp: `nx()`: キーがまだ存在しない場合にのみ、キーを設定します。

source: `odd` - `true` if the element's count is odd
ja_jp: `odd` - 要素のカウントが奇数である場合 `true`

source: `odd` - `true` if the zero-based index is odd
ja_jp: `odd` - ゼロ基準のインデックスが奇数であれば `true` となります。

source: `openssl` commands to generate keys
ja_jp: キーを生成するための `openssl` コマンド

source: `openssl` commands to perform the conversion
ja_jp: 変換用の `openssl`コマンド

source: `opentelemetry-exporter-jaeger` has been moved to the Quarkiverse Hub: https://github.com/quarkiverse/quarkus-opentelemetry-exporter.
ja_jp: `opentelemetry-exporter-jaeger` はQuarkiverse Hub: https://github.com/quarkiverse/quarkus-opentelemetry-exporter に移動しました。

source: `opentelemetry-exporter-otlp` is now the default exporter for OpenTelemetry and has been included into the `quarkus-opentelemetry` extension.
ja_jp: `opentelemetry-exporter-otlp` は、OpenTelemetryのデフォルトエクスポーターとして、 `quarkus-opentelemetry` エクステンションに含まれています。

source: `option java_generic_services = true;` will automatically be removed from proto file containing it.
ja_jp: `option java_generic_services = true;` は、それを含む proto ファイルから自動的に削除されます。

source: `opts=optional` is mandatory as we don't want the build to fail if only part of the configuration documentation has been generated
ja_jp: `opts=optional` は、設定ドキュメントの一部しか生成されていない場合にビルドを失敗させたくないので必須です。

source: `opts=optional` is mandatory to not fail the build if only part of the configuration documentation has been generated.
ja_jp: `opts=optional` は、設定ドキュメントの一部しか生成されていない場合に、ビルドを失敗させないために必須です。

source: `order by ...` which will expand to `from EntityName order by ...`
ja_jp: `order by ...` は `from EntityName order by ...` に展開されます

source: `org.acme.User` has the `name` property.
ja_jp: `org.acme.User` には `name` プロパティーがあります。

source: `org.acme` placeholder for package name
ja_jp: パッケージ名の `org.acme` プレースホルダー

source: `org.apache.pulsar.client.api.Message` is provided by the underlying Pulsar client and can be used directly with the consumer method.
ja_jp: `org.apache.pulsar.client.api.Message` は、基盤となる Pulsar クライアントによって提供され、コンシューマーメソッドで直接使用できます。

source: `org.jboss.resteasy.reactive.RestResponse` used as effective way of getting response properties via RestResponse directly from RestClient, as described in <<Using RestResponse>>
ja_jp: `org.jboss.resteasy.reactive.RestResponse` は、RestClient から RestResponse を介してレスポンスプロパティーを直接取得する効果的な方法として使用されます。 詳細は <<Using RestResponse>> を参照してください。

source: `outgoing` channels are mapped to RabbitMQ exchanges and `incoming` channels are mapped to RabbitMQ queues as required by the broker.
ja_jp: ブローカーの要求に応じて、 `outgoing` チャネルは RabbitMQ エクスチェンジにマップされ、 `incoming` チャネルは RabbitMQ キューにマップされます。

source: `outputFile` - specifies the file to persist the dependency tree to;
ja_jp: `outputFile` - 依存関係ツリーを永続化するファイルを指定します。
